# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 14  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [19,27,  44,40,  38,94]  # P3/8
  - [96,68,  86,152,  180,137]  # P4/16
  - [140,301,  303,264,  238,542]  # P5/32
  - [436,615,  739,380,  925,792]  # P6/64`

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
   [-1, 3, C3, [128]],   # size 320*320
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8   size 160*160
   [2, 1, MaxPool,[2]], #4
   [[-1, 3], 1, Concat, [1]], #5
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 7-P4/16  size  80*80
   [ 6, 1, MaxPool, [2]], #8
   [[-1, 7], 1, Concat, [1]], #9
   [-1, 9, C3, [512]],  #10
   [-1, 1, Conv, [768, 3, 2]],  # 11-P5/32  size  40*40
   [ 10, 1, MaxPool, [2]], #12
   [[-1, 11], 1, Concat, [1]], #13
   [-1, 6, C3, [768]],  #14
   [-1, 1, Conv, [1024, 3, 2]],  # 15-P6/64 size  20*20
   [14, 1, MaxPool, [2]],  #16
   [[ -1, 15], 1, Concat,[1]],  #17
   [-1, 3, C3, [1024]], #18
   [-1, 1, SPPF, [1024, 5]],  # 19
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [768, 1, 1]],  #20
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #21
   [-1, 1, Coord,[384,384]], #22
   [[-1, 14], 1, Concat, [1]],  # cat backbone P5  #23
   [-1, 3, C3, [768, False]],  # 24    # 40*40

   [-1, 1, Conv, [512, 1, 1]],  #25
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [-1, 1, Coord,[ 256,256 ] ],
   [[-1, 10], 1, Concat, [1]],  # cat backbone P4  #26
   [-1, 3, C3, [512, False]],  # 29   # 80*80-

   [-1, 1, Conv, [256, 1, 1]], # 30
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [-1, 1, Coord,[ 128,128 ] ],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P3    # 30
   [-1, 3, C3, [256, False]],  # 23 (P3/8-small)  #31   # 160*160

   [-1, 1, Conv, [256, 3, 2]],#32
   [[-1, 30, 10], 1, Concat, [1]],  # cat head P4#36     # concat 10
   [-1, 3, C3, [512, False]],  # 26 (P4/16-medium)#34    # 80*80

   [-1, 1, Conv, [512, 3, 2]],#35
   [[-1, 25, 14], 1, Concat, [1]],  # cat head P5#36  # concat 14
   [-1, 3, C3, [768, False]],  # 29 (P5/32-large)#37   #40*40

   [-1, 1, Conv, [768, 3, 2]],#38
   [[-1, 20, 18], 1, Concat, [1]],  # cat head P6#39   # concat 18
#   [-1, 1, Conv, [1024,1,1]],
   [-1, 3, C3, [1024, False]],  # 32 (P6/64-xlarge)#40  #20*20

   [[34, 37, 40, 43], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5, P6)
  ]
